app/controllers/users_controller.rb

  def create
    user = Users.new(user_params)
    if user.save
---
INSERT INTO "users" ("created_at", "email", "fname", "lname", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def show
    @user = Users.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]